espressif/esp-idf/components/soc/esp32p4/include/soc/usb_dwc_struct.h
typedef union {
    struct {
        uint32_t inepmsk0: 1;
        uint32_t inepmsk1: 1;
        uint32_t inepmsk2: 1;
        uint32_t inepmsk3: 1;
        uint32_t inepmsk4: 1;
        uint32_t inepmsk5: 1;
        uint32_t inepmsk6: 1;
        uint32_t inepmsk7: 1;
        uint32_t inepmsk8: 1;
        uint32_t inepmsk9: 1;
        uint32_t inepmsk10: 1;
        uint32_t inepmsk11: 1;
        uint32_t inepmsk12: 1;
        uint32_t inepmsk13: 1;
        uint32_t inepmsk14: 1;
        uint32_t inepmsk15: 1;
        uint32_t outepmsk0: 1;
        uint32_t outepmsk1: 1;
        uint32_t outepmsk2: 1;
        uint32_t outepmsk3: 1;
        uint32_t outepmsk4: 1;
        uint32_t outepmsk5: 1;
        uint32_t outepmsk6: 1;
        uint32_t outepmsk7: 1;
        uint32_t outepmsk8: 1;
        uint32_t outepmsk9: 1;
        uint32_t outepmsk10: 1;
        uint32_t outepmsk11: 1;
        uint32_t outepmsk12: 1;
        uint32_t outepmsk13: 1;
        uint32_t outepmsk14: 1;
        uint32_t outepmsk15: 1;
    };
    uint32_t val;
} usb_dwc_daintmsk_reg_t;

typedef union {
    struct {
        uint32_t dvbusdis: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_dvbusdis_reg_t;

typedef union {
    struct {
        uint32_t dvbuspulse: 12;
        uint32_t reserved_12: 20;
    };
    uint32_t val;
} usb_dwc_dvbuspulse_reg_t;

typedef union {
    struct {
        uint32_t nonisothren: 1;
        uint32_t isothren: 1;
        uint32_t txthrlen: 9;
        uint32_t ahbthrratio: 2;
        uint32_t reserved_13: 3;
        uint32_t rxthren: 1;
        uint32_t rxthrlen: 9;
        uint32_t reserved_26: 1;
        uint32_t arbprken: 1;
        uint32_t reserved_28: 4;
    };
    uint32_t val;
} usb_dwc_dthrctl_reg_t;

typedef union {
    struct {
        uint32_t ineptxfempmsk: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_diepempmsk_reg_t;

typedef union {
    struct {
        uint32_t echinepint: 16;
        uint32_t echoutepint: 16;
    };
    uint32_t val;
} usb_dwc_deachint_reg_t;

typedef union {
    struct {
        uint32_t echinepmsk0: 1;
        uint32_t echinepmsk1: 1;
        uint32_t echinepmsk2: 1;
        uint32_t echinepmsk3: 1;
        uint32_t echinepmsk4: 1;
        uint32_t echinepmsk5: 1;
        uint32_t echinepmsk6: 1;
        uint32_t echinepmsk7: 1;
        uint32_t echinepmsk8: 1;
        uint32_t echinepmsk9: 1;
        uint32_t echinepmsk10: 1;
        uint32_t echinepmsk11: 1;
        uint32_t echinepmsk12: 1;
        uint32_t echinepmsk13: 1;
        uint32_t echinepmsk14: 1;
        uint32_t echinepmsk15: 1;
        uint32_t echoutepmsk0: 1;
        uint32_t echoutepmsk1: 1;
        uint32_t echoutepmsk2: 1;
        uint32_t echoutepmsk3: 1;
        uint32_t echoutepmsk4: 1;
        uint32_t echoutepmsk5: 1;
        uint32_t echoutepmsk6: 1;
        uint32_t echoutepmsk7: 1;
        uint32_t echoutepmsk8: 1;
        uint32_t echoutepmsk9: 1;
        uint32_t echoutepmsk10: 1;
        uint32_t echoutepmsk11: 1;
        uint32_t echoutepmsk12: 1;
        uint32_t echoutepmsk13: 1;
        uint32_t echoutepmsk14: 1;
        uint32_t echoutepmsk15: 1;
    };
    uint32_t val;
} usb_dwc_deachintmsk_reg_t;

typedef union {
    struct {
        uint32_t xfercomplmsl: 1;
        uint32_t epdisbldmsk: 1;
        uint32_t ahberrmsk: 1;
        uint32_t timeoutmsk: 1;
        uint32_t intkntxfempmsk: 1;
        uint32_t intknepmismsk: 1;
        uint32_t inepnakeffmsk: 1;
        uint32_t reserved_7: 1;
        uint32_t txfifoundrnmsk: 1;
        uint32_t bnainintrmsk: 1;
        uint32_t reserved_10: 3;
        uint32_t nakmsk: 1;
        uint32_t reserved_14: 18;
    };
    uint32_t val;
} usb_dwc_diepeachmski_reg_t;

typedef union {
    struct {
        uint32_t xfercomplmsk: 1;
        uint32_t epdisbldmsk: 1;
        uint32_t ahberrmsk: 1;
        uint32_t setupmsk: 1;
        uint32_t outtknepdismsk: 1;
        uint32_t reserved_5: 1;
        uint32_t back2backsetup: 1;
        uint32_t reserved_7: 1;
        uint32_t outpkterrmsk: 1;
        uint32_t bnaoutintrmsk: 1;
        uint32_t reserved_10: 2;
        uint32_t bbleerrmsk: 1;
        uint32_t nakmsk: 1;
        uint32_t nyetmsk: 1;
        uint32_t reserved_15: 17;
    };
    uint32_t val;
} usb_dwc_doepeachmski_reg_t;

typedef union {
    struct {
        uint32_t mps: 2;
        uint32_t reserved_2: 9;
        uint32_t reserved_11: 4;
        uint32_t usbactep: 1;
        uint32_t reserved_16: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t reserved_20: 1;
        uint32_t stall: 1;
        uint32_t txfnum: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t reserved_28: 2;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_dwc_diepctl0_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t timeout: 1;
        uint32_t intkntxfemp: 1;
        uint32_t intknepmis: 1;
        uint32_t inepnakeff: 1;
        uint32_t txfemp: 1;
        uint32_t txfifoundrn: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved_10: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyetintrpt: 1;
        uint32_t reserved_15: 17;
    };
    uint32_t val;
} usb_dwc_diepint0_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 7;
        uint32_t reserved_7: 12;
        uint32_t pktcnt: 2;
        uint32_t reserved_21: 11;
    };
    uint32_t val;
} usb_dwc_dieptsiz0_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr;
    };
    uint32_t val;
} usb_dwc_diepdma0_reg_t;

typedef union {
    struct {
        uint32_t ineptxfspcavail: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_dtxfsts0_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_dwc_diepdmab0_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t reserved_11: 4;
        uint32_t usbactep: 1;
        uint32_t dpid: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t reserved_20: 1;
        uint32_t stall: 1;
        uint32_t txfnum: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t setd0pid: 1;
        uint32_t setd1pid: 1;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_dwc_diepctl_reg_t;

